# Напишите программу, которая считает стоимость трех компьютеров,
# состоящих из монитора, системного блока, клавиатуры и мыши.

q, w, e, r = int(input()), int(input()), int(input()), int(input())
print((q + w + e + r) * 3)
