# Дано положительное действительное число. Выведите его дробную часть.

number = float(input())

print(number - int(number))
# or print(number % 1)
