# Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит
# указанные строки через разделитель.

q, w, e, r = input(), input(), input(), input()
print(w, e, r, sep=q)
