# У известного американского писателя Рэя Бредбери есть роман «451 градус по Фаренгейту». Напишите программу,
# которая определяет, какой температуре по шкале Цельсия соответствует указанное значение по шкале Фаренгейта.

fareng = float(input())

print((5 / 9) * (fareng - 32))
