# Напишите программу, которая определяет наименьшее из четырёх чисел.

q, w, e, r = int(input()), int(input()), int(input()), int(input())
print(min(q, w, e, r))
