# На вход программе подается строка текста. Напишите программу,
# которая заменяет все вхождения цифры 1 на слово «one».

print(input().replace('1', 'one'))
