# Дано предложение и количество раз которое его надо повторить. Напишите программу,
# которая повторяет данное предложение нужное количество раз.

stroka, number = input(), int(input())

for _ in range(number):
    print(stroka)
