# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.

a, b = float(input()), float(input())
print(1 / 2 * a * b)
