# Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит фразу:
#
# «Футбольная команда [введённая строка] имеет длину [длина введённой строки] символов».

n = input()

print(f'Футбольная команда {n} имеет длину {len(n)} символов')