# Напишите программу, в которой вычисляется сумма, разность и произведение двух целых чисел, введенных с клавиатуры.

q, w = int(input()), int(input())
print(f'{q} + {w} = {q + w}')
print(f'{q} - {w} = {q - w}')
print(f'{q} * {w} = {q * w}')
