# Напишите программу, которая определяет, является число четным или нечетным.

n = int(input())
if n % 2 == 0:
    print('Четное')
else:
    print('Нечетное')



