# Напишите программу, которая считывает три целых числа и выводит на
# экран их сумму. Каждое число записано в отдельной строке.

q, w, e = int(input()), int(input()), int(input())
print(q + w + e)
