# Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.

a = int(input())
print('Объем =', a**3)
print('Площадь полной поверхности =', 6 * a**2)

