# На вход программе подается строка текста. Напишите программу, которая удаляет все вхождения символа «@»

print(input().replace('@', ''))