# Напишите программу, которая находит полное число метров по заданному числу сантиметров.

print(int(input()) // 100)
