# Напишите программу, которая выводит указанный треугольник, состоящий из звездочек (*).
print('*',
      '**',
      '***',
      '****',
      '*****',
      '******',
      '*******', sep='\n')
