# Напишите программу, которая определяет наименьшее из двух чисел.

q, w = int(input()), int(input())
print(min(q, w))
